tylertms/dspic33e-sim/conformance/oscillator.c
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x1eu);
    dspic33_reset(cpu, 0u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_CLOCK_LOCK);
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x02u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL,
                         OSCILLATOR_CLOCK_LOCK | OSCILLATOR_SWITCH_ENABLE);
    expect(state, control(cpu) == 0x0281u && cpu->oscillator.active,
           "FCKSM zero permits switch with CLKLOCK set");
    expect(state, cpu->events.count == 1u,
           "conditional CLKLOCK permission schedules switch");
    write_protected_byte(cpu, OSCILLATOR_CONTROL,
                         OSCILLATOR_CLOCK_LOCK | OSCILLATOR_LP_ENABLE);
    expect(state, (control(cpu) & OSCILLATOR_LP_ENABLE) != 0u,
           "FCKSM zero permits LPOSCEN change with CLKLOCK set");

    dspic33_reset(cpu, 0u);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x9eu);
    dspic33_reset(cpu, 0u);
    expect(state, program_fosc(cpu, 0x1eu), "FOSC RTSP enables clock switching");
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x02u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, control(cpu) == 0x0201u && cpu->oscillator.active,
           "immediate FCKSM update affects next switch");
    expect(state, cpu->events.count == 1u, "RTSP-enabled switch schedules completion");
    expect(state, program_fosc(cpu, 0x009eu),
           "FOSC RTSP disables active software switching");
    expect(state, !cpu->oscillator.active && control(cpu) == 0x0200u,
           "switch disable aborts active software request");
    expect(state, dspic33_device_advance(cpu, 32u) && control(cpu) == 0x0200u,
           "switch disable invalidates stale completion");

    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x5eu);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x0079u);
    dspic33_reset(cpu, 0u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, control(cpu) == 0x1321u,
           "FRCPLL to POSCPLL direct switch remains pending");
    expect(state, cpu->oscillator.active && cpu->events.count == 0u,
           "first direct PLL request schedules no completion");
    expect(state, program_fosc(cpu, 0x005du),
           "POSCMD mode changes during direct PLL request");
    expect(state,
           dspic33_device_advance(cpu, 32u) && control(cpu) == 0x1321u &&
               cpu->events.count == 0u,
           "POSCMD mode change cannot complete direct PLL request");
    expect(state, program_fosc(cpu, 0x005fu),
           "POSCMD disables target during direct PLL request");
    expect(state, program_fosc(cpu, 0x005eu),
           "POSCMD restores target during direct PLL request");
    expect(state,
           dspic33_device_advance(cpu, 32u) && control(cpu) == 0x1321u &&
               cpu->events.count == 0u,
           "POSCMD restoration cannot complete direct PLL request");
    expect(state, program_fwdt(cpu, 0x00dfu), "PLLK clears during direct PLL request");
    expect(state,
           dspic33_device_advance(cpu, 32u) && control(cpu) == 0x1321u &&
               cpu->events.count == 0u,
           "PLLK clear cannot complete direct PLL request");
    expect(state, program_fwdt(cpu, 0x00ffu),
           "PLLK restores during direct PLL request");
    expect(state,
           dspic33_device_advance(cpu, 32u) && control(cpu) == 0x1321u &&
               cpu->events.count == 0u,
           "PLLK restore cannot complete direct PLL request");
    write_protected_byte(cpu, OSCILLATOR_CONTROL, 0u);
    expect(state, control(cpu) == 0x1320u && !cpu->oscillator.active,
           "explicit clear aborts unsupported direct PLL request");

    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x007bu);
    dspic33_reset(cpu, 0u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x01u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, control(cpu) == 0x3121u,
           "POSCPLL to FRCPLL direct switch remains pending");
    expect(state, cpu->oscillator.active && cpu->events.count == 0u,
           "second direct PLL request schedules no completion");

    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x0078u);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x005fu);
    dspic33_reset(cpu, 0u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x02u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, control(cpu) == 0x0201u && cpu->oscillator.active,
           "disabled POSC leaves switch pending");
    expect(state, cpu->events.count == 0u, "disabled POSC schedules no completion");
    expect(state, program_fosc(cpu, 0x005eu), "FOSC RTSP enables pending POSC");
    expect(state, cpu->events.count == 1u && cpu->oscillator.generation == 2u,
           "enabled POSC restarts modeled switch interval");
    expect(state, dspic33_device_advance(cpu, 32u) && control(cpu) == 0x2200u,
           "enabled POSC completes pending switch");

    dspic33_reset(cpu, 0u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL + 1u, 0x02u);
    write_protected_byte(cpu, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, cpu->events.count == 1u && cpu->oscillator.active,
           "available POSC starts modeled switch");
    expect(state, program_fosc(cpu, 0x005fu), "FOSC RTSP disables pending POSC");
    expect(state, dspic33_device_advance(cpu, 32u) && control(cpu) == 0x0201u,
           "disabled POSC invalidates scheduled completion");
    expect(state, program_fosc(cpu, 0x005eu), "FOSC RTSP restores pending POSC");
    expect(state, dspic33_device_advance(cpu, 32u) && control(cpu) == 0x2200u,
           "restored POSC completes fresh interval");
}

static void hardware_failure_cases(OscillatorConformance* state, Dspic33* cpu) {
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x007au);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x001eu);
    dspic33_reset(cpu, 0u);
    dspic33_load_program_word(cpu, 0x0004u, 0x000100u);
    dspic33_set_working_register(cpu, 15u, 0x2000u);
    cpu->stop_on_trap = true;
    expect(state, dspic33_oscillator_failure_detected(cpu),
           "FSCM accepts primary oscillator failure");
    expect(state, control(cpu) == 0x0208u,
           "FSCM falls back to FRC and retains requested source");
    expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0002u) != 0u,
           "FSCM latches oscillator-fail status");
    expect(state, dspic33_step(cpu) == DSPIC33_TRAPPED,
           "FSCM dispatches oscillator-fail trap");
    expect(state,
           cpu->pc == 0x000102u && cpu->last_trap == 0u && cpu->last_trap_return == 0u,
           "FSCM enters oscillator-fail vector");

