tylertms/dspic33e-sim/conformance/oscillator.c
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x005eu);
    dspic33_reset(cpu, 0u);
    expect(state, !dspic33_oscillator_failure_detected(cpu) && control(cpu) == 0x2200u,
           "disabled FSCM ignores external-source failure");

    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x0078u);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x001eu);
    dspic33_reset(cpu, 0u);
    expect(state, !dspic33_oscillator_failure_detected(cpu) && control(cpu) == 0u,
           "FSCM ignores internal-source failure");

    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x007au);
    dspic33_reset(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state, !dspic33_oscillator_failure_detected(cpu) && control(cpu) == 0x2200u,
           "FSCM is disabled during Sleep");

    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSCSEL, 0x0078u);
    dspic33_load_configuration_word(cpu, CONFIGURATION_FOSC, 0x005eu);
}

static void pll_lock_sequence_cases(OscillatorConformance* state, Dspic33* source,
                                    Dspic33* copy) {
    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00dfu);
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state,
           control(source) == 0x3300u && !source->oscillator.active &&
               source->oscillator.lock_pending,
           "PLLK zero transfers source before PLL lock");
    expect(state, source->events.count == 1u && source->events.items[0].source == 2u,
           "PLLK zero leaves one pending lock phase");
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_IO_LOCK);
    expect(state,
           control(source) == 0x3340u && source->oscillator.lock_pending &&
               source->events.count == 1u,
           "unrelated OSCCON write preserves pending PLL lock");
    expect(state, dspic33_device_advance(source, 27u) && control(source) == 0x3340u,
           "PLLK zero remains unlocked before modeled lock deadline");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x3360u,
           "PLLK zero sets lock after source transfer");
    expect(state, !source->oscillator.lock_pending && source->events.count == 0u,
           "PLLK zero completion clears lock lifecycle");

    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00ffu);
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, control(source) == 0x0301u && source->oscillator.active,
           "PLLK one holds source transfer until lock");
    expect(state,
           source->oscillator.source_ready && source->oscillator.lock_pending &&
               source->events.count == 1u && source->events.items[0].source == 2u,
           "PLLK one waits for the pending lock phase");
    expect(state, program_fwdt(source, 0x00dfu),
           "PLLK RTSP clears pending wait policy");
    expect(state,
           source->oscillator.generation == 1u && source->events.count == 1u &&
               control(source) == 0x3300u && source->oscillator.lock_pending,
           "PLLK clear releases source without moving lock deadline");
    expect(state, dspic33_device_advance(source, 30u) && control(source) == 0x3300u,
           "PLLK-cleared source remains unlocked before original deadline");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x3320u,
           "PLLK clear retains original lock completion");

    dspic33_load_configuration_word(source, CONFIGURATION_FOSC, 0x005fu);
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, source->oscillator.active && source->events.count == 0u,
           "disabled POSC holds PLLK-zero request");
    expect(state, program_fwdt(source, 0x00ffu),
           "PLLK RTSP enables wait before source availability");
    expect(state, source->events.count == 0u,
           "unavailable source still schedules no PLL event");
    expect(state, program_fosc(source, 0x005eu),
           "POSCMD RTSP enables PLLK-one request");
    expect(state, source->events.count == 1u && source->events.items[0].source == 0u,
           "available source honors updated PLLK policy");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0x3320u,
           "updated PLLK policy completes locked switch");

    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00dfu);
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    expect(state, dspic33_copy(copy, source), "copy preserves pending PLL lock phase");
    expect(state,
           copy->oscillator.lock_pending && copy->events.count == 1u &&
               copy->events.items[0].source == 2u,
           "copy retains PLL lock phase identity");
    expect(state, dspic33_device_advance(source, 21u) && control(source) == 0x3320u,
           "source completes copied PLL lock phase");
    expect(state, dspic33_device_advance(copy, 21u) && control(copy) == 0x3320u,
           "copy independently completes PLL lock phase");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "warm reset executes during pending PLL lock");
    expect(state,
           control(source) == 0x3300u && source->oscillator.lock_pending &&
               source->events.count == 1u && source->events.items[0].source == 2u,
           "warm reset reconstructs pending PLL lock phase");
    expect(state, dspic33_device_advance(source, 19u) && control(source) == 0x3300u,
           "warm-reset PLL lock remains pending before deadline");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x3320u,
           "warm-reset PLL lock completes at preserved deadline");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_load_program_word(source, 0u, OPCODE_SLEEP);
    source->pc = 0u;
    expect(state, dspic33_step(source) == DSPIC33_SLEEPING,
           "Sleep executes during pending PLL lock");
    expect(state, !source->oscillator.lock_pending && control(source) == 0x3300u,
           "Sleep cancels pending PLL lock phase");
    expect(state, dspic33_device_advance(source, 31u) && control(source) == 0x3300u,
           "Sleep prevents stale PLL lock completion");

    dspic33_load_configuration_word(source, CONFIGURATION_FWDT, 0x00ffu);
}

static void lifecycle_cases(OscillatorConformance* state, Dspic33* source,
                            Dspic33* copy) {
    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    expect(state, dspic33_copy(copy, source), "copy preserves oscillator state");
    expect(state,
           copy->oscillator.active &&
               copy->oscillator.generation == source->oscillator.generation,
           "copy preserves active oscillator generation");
    expect(state, copy->events.count == source->events.count,
           "copy preserves pending oscillator event");
    expect(state, dspic33_device_advance(source, 22u) && control(source) == 0x3320u,
           "source completes copied switch interval");
    expect(state, dspic33_device_advance(copy, 22u) && control(copy) == 0x3320u,
           "copy independently completes switch interval");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    dspic33_load_program_word(source, 0u, OPCODE_RESET);
    source->pc = 0u;
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "warm reset executes during oscillator switch");
    expect(state, control(source) == 0x0301u && source->oscillator.active,
           "warm reset preserves active oscillator switch");
    expect(state, source->events.count == 1u,
           "warm reset reconstructs pending oscillator event");
    expect(state, source->events.items[0].cycle - source->device_cycles == 20u,
           "warm reset preserves remaining oscillator interval");
    expect(state, dspic33_device_advance(source, 19u) && control(source) == 0x0301u,
           "warm-reset switch remains pending before preserved deadline");
    expect(state, dspic33_device_advance(source, 1u) && control(source) == 0x3320u,
           "warm-reset switch completes at preserved deadline");

    dspic33_reset(source, 0u);
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    dspic33_device_advance(source, 10u);
    dspic33_reset(source, 0u);
    expect(state, control(source) == 0u, "POR resets OSCCON from configuration");
    expect(state, !source->oscillator.active && source->events.count == 0u,
           "POR cancels pending oscillator switch");
    expect(state, dspic33_device_advance(source, 32u) && control(source) == 0u,
           "POR prevents stale oscillator completion");

    dspic33_reset(source, 0u);
    source->device_cycles = UINT64_MAX;
    write_protected_byte(source, OSCILLATOR_CONTROL + 1u, 0x03u);
    write_protected_byte(source, OSCILLATOR_CONTROL, OSCILLATOR_SWITCH_ENABLE);
    expect(state, source->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
           "switch schedule overflow reports event error");
    expect(state, control(source) == 0x0301u && source->events.count == 0u,
           "failed schedule leaves requested switch state visible");

    dspic33_reset(source, 0u);
    load_sequence(source, OPCODE_MOV_BYTE_W2_W1, OPCODE_RESET, OPCODE_MOV_BYTE_W3_W1);
    dspic33_load_program_word(source, 0x0026u, OPCODE_MOV_BYTE_W0_W1);
    source->pc = 0x0020u;
    dspic33_set_working_register(source, 0u, 0x40u);
    dspic33_set_working_register(source, 1u, OSCILLATOR_CONTROL);
    dspic33_set_working_register(source, 2u, 0x46u);
    dspic33_set_working_register(source, 3u, 0x57u);
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "reset invalidation first key executes");
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "reset executes between protected keys");
    source->pc = 0x0024u;
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "post-reset second key executes");
    expect(state, dspic33_step(source) == DSPIC33_RUNNING,
           "post-reset final write executes");
    expect(state, (control(source) & OSCILLATOR_IO_LOCK) == 0u,
           "reset invalidates protected key sequence");
}

int main(void) {
    Dspic33 source;
    Dspic33 copy;
    OscillatorConformance state = {0u, 0u, 0u};
    if (!dspic33_initialize(&source) || !dspic33_initialize(&copy)) {
        fprintf(stderr, "failed to initialize simulator\n");
        return 2;
    }
    dspic33_load_configuration_word(&source, 0xf80008u, 0x005eu);
    reset_cases(&state, &source);
    protection_cases(&state, &source);
    switch_cases(&state, &source);
    failure_trap_cases(&state, &source);
    configuration_admission_cases(&state, &source);
    hardware_failure_cases(&state, &source);
    pll_lock_sequence_cases(&state, &source, &copy);
    lifecycle_cases(&state, &source, &copy);
    expect(&state, state.cases == 161u, "oscillator assertion arithmetic");
    printf("[oscillator-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32
           "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&copy);
    dspic33_destroy(&source);
    return state.failed == 0u ? 0 : 1;
}
